{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ERROR",
    "2": "B-HARDWARE",
    "3": "B-OS",
    "4": "B-SOFTWARE",
    "5": "B-VERSION",
    "6": "I-ERROR",
    "7": "I-HARDWARE",
    "8": "I-OS",
    "9": "I-SOFTWARE",
    "10": "I-VERSION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ERROR": 1,
    "B-HARDWARE": 2,
    "B-OS": 3,
    "B-SOFTWARE": 4,
    "B-VERSION": 5,
    "I-ERROR": 6,
    "I-HARDWARE": 7,
    "I-OS": 8,
    "I-SOFTWARE": 9,
    "I-VERSION": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
